programming/c/linting.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>linting</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">linting</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">indent(1)</a>
<ul>
<li><a href="#sec-1-1">styles</a></li>
<li><a href="#sec-1-2">notes</a></li>
</ul>
</li>
<li><a href="#sec-2">splint(1)</a></li>
<li><a href="#sec-3">STYLE(9)</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">indent(1)</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">styles</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">
-gnu, --gnu-style     ; Use GNU coding style.  This is the default.
-kr, --k-and-r-style  ; Use Kernighan &amp; Ritchie coding style.
-linux, --linux-style ; Use Linux coding style.
-orig, --original     ; Use the original Berkeley coding style.
</pre>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">notes</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>this fixes the spacing in functions
</li>
<li>doesn't break comments that are over 80 columns
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">splint(1)</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
https://ulissesaraujo.wordpress.com/2009/05/03/splint-the-static-c-code-checker/

https://coelhorjc.wordpress.com/2015/02/19/how-to-do-static-code-analysis-in-cc-using-sparse-splint-cpplint-and-clang/comment-page-1/

How to do static code analysis in C/C++ (using sparse, splint,
cpplint and clang)
</pre>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">STYLE(9)</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="./c.html">back</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
